-- MySQL dump 10.13  Distrib 8.0.40, for Win64 (x86_64)
--
-- Host: localhost    Database: contactdb
-- ------------------------------------------------------
-- Server version	8.0.40

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `employees`
--

DROP TABLE IF EXISTS `employees`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `employees` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  `age` varchar(50) NOT NULL,
  `number` varchar(100) NOT NULL,
  `email` varchar(100) DEFAULT NULL,
  `address` varchar(100) NOT NULL,
  `department_id` int NOT NULL,
  `employee_rank` varchar(45) NOT NULL,
  `salary` int NOT NULL,
  PRIMARY KEY (`id`),
  KEY `fk_employees_departments_idx` (`department_id`),
  CONSTRAINT `fk_employees_departments` FOREIGN KEY (`department_id`) REFERENCES `departments` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=126 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `employees`
--

LOCK TABLES `employees` WRITE;
/*!40000 ALTER TABLE `employees` DISABLE KEYS */;
INSERT INTO `employees` VALUES (1,'이명희','27','010-1234-9998','cr@naber.com','anyang-22-05',5,'사원',3100),(2,'김광섭','25','010-1234-1111','kk@naber.com','busan-85-23',1,'사원',3000),(3,'이창섭','25','010-1234-1112','a@naber.com','busan-66-23',1,'사원',3000),(4,'김은희','25','010-1234-1113','b@naber.com','seoul-33-23',2,'사원',3000),(5,'박상섭','26','010-1234-1114','c@naber.com','seoul-34-22',2,'사원',3000),(6,'김찬희','26','010-1234-1115','d@naber.com','seoul-23-11',3,'사원',3000),(7,'오영희','26','010-1234-1116','e@naber.com','daegu-23-11',4,'사원',3000),(8,'이재성','24','010-1234-1117','f@naber.com','daegu-77-11',4,'사원',3000),(9,'김재규','27','010-1234-1118','g@naber.com','incheon-77-11',4,'사원',3100),(10,'한기석','27','010-1234-1119','h@naber.com','seoul-77-11',5,'사원',3200),(11,'김예은','27','010-1234-1210','j@naber.com','seoul-77-12',6,'사원',3200),(12,'오기훈','28','010-1234-1211','k@naber.com','seoul-11-11',7,'사원',3200),(13,'대기훈','30','010-1234-1212','q@naber.com','seoul-19-11',1,'대리',3500),(14,'이은혜','30','010-1234-9999','w@naber.com','seoul-77-13',2,'대리',3500),(15,'김소희','30','010-1234-1213','aa@naber.com','busan-15-11',3,'대리',3600),(16,'시민기','30','010-1234-1214','ab@naber.com','busan-16-11',3,'대리',3600),(17,'임기동','30','010-1234-1215','ac@naber.com','busan-22-00',4,'대리',3600),(18,'구동기','31','010-1234-1216','ad@naber.com','busan-22-01',5,'대리',3600),(19,'길마동','31','010-1234-1217','ae@naber.com','busan-22-02',6,'대리',3600),(20,'임장정','32','010-1234-1218','af@naber.com','busan-22-03',7,'대리',3600),(21,'김연희','35','010-1234-1219','ag@naber.com','seoul-22-00',1,'과장',4000),(22,'김아중','35','010-1234-1220','ah@naber.com','seoul-22-01',2,'과장',4000),(23,'김경수','36','010-1234-1221','ai@naber.com','gwangju-22-00',3,'과장',4100),(24,'한마동','36','010-1234-1222','aj@naber.com','gwangju-22-01',4,'과장',4100),(25,'김은서','36','010-1234-1223','ak@naber.com','gwangju-22-02',5,'과장',4100),(26,'강서율','36','010-1234-1224','al@naber.com','gwangju-22-03',6,'과장',4100),(27,'김건우','36','010-1234-1224','am@naber.com','daegu-22-00',7,'과장',4200),(28,'영서희','39','010-1234-1225','ao@naber.com','daegu-22-01',1,'차장',4400),(29,'김대윤','39','010-1234-1226','ap@naber.com','daegu-22-02',2,'차장',4400),(30,'이건우','39','010-1234-1227','ba@naber.com','daejun-22-00',3,'차장',4400),(31,'황진우','39','010-1234-1228','bb@naber.com','daejun-22-01',4,'차장',4500),(32,'황기석','39','010-1234-1229','bc@naber.com','daejun-22-02',5,'차장',4500),(33,'엄석대','40','010-1234-1230','bd@naber.com','daejun-22-03',6,'차장',4500),(34,'김준','40','010-1234-1231','be@naber.com','suwon-22-00',7,'차장',4600),(35,'방민준','40','010-1234-1231','be@naber.com','anyang-22-04',7,'차장',4600),(36,'김래원','43','010-1234-1232','ca@naber.com','suwon-22-01',1,'부장',5000),(37,'이경희','43','010-1234-1233','cb@naber.com','suwon-22-02',2,'부장',5000),(38,'강백호','44','010-1234-1234','cc@naber.com','suwon-22-03',3,'부장',5000),(39,'강서당','44','010-1234-1235','cd@naber.com','anyang-22-00',4,'부장',5000),(40,'이서대','45','010-1234-1236','ce@naber.com','anyang-22-01',5,'부장',5000),(41,'양기준','45','010-1234-1237','cq@naber.com','anyang-22-02',6,'부장',5000),(42,'김준열','46','010-1234-1238','cw@naber.com','anyang-22-03',7,'부장',5000),(43,'김미래','25','010-2345-1111','da@naber.com','anyang-33-11',7,'사원',3000),(44,'김나라','26','010-2345-1122','dc@naber.com','anyang-33-22',7,'사원',3100),(45,'김지원','32','010-2345-1133','dn@naber.com','busan-33-11',7,'대리',3500),(46,'박지수','30','010-2345-1144','dg@naber.com','daegu-33-11',7,'대리',3600),(47,'김건우','26','010-2345-1155','ea@naber.com','anyang-44-58',8,'사원',3000),(48,'김지우','25','010-2345-1166','eb@naber.com','busan-44-12',8,'사원',3100),(49,'박준수','30','010-2345-1177','ef@naber.com','daejun-33-11',8,'대리',3500),(50,'박천우','32','010-2345-1188','eg@naber.com','seoul-44-11',8,'대리',3700),(51,'황진우','36','010-2345-1199','eh@naber.com','seoul-44-22',8,'과장',4200),(52,'김준우','37','010-2345-2211','er@naber.com','anyang-44-22',8,'과장',4200),(53,'김자연','40','010-2345-2323','ej@naber.com','gwangju-33-11',8,'차장',4500),(54,'임주원','40','010-2345-2245','ek@naber.com','gwangju-33-22',8,'차장',4500),(55,'임지은','45','010-2345-2255','ep@naber.com','incheon-11-11',8,'부장',5100),(56,'김성운','43','010-2345-2266','es@naber.com','incheon-11-33',8,'부장',5000),(57,'이영우','24','010-2345-2277','fa@naber.com','suwon-33-11',9,'사원',3000),(58,'이지선','25','010-2345-2288','fc@naber.com','seoul-44-56',9,'사원',3000),(59,'박태우','25','010-2345-2298','fe@naber.com','gwangju-33-85',9,'사원',3100),(60,'김주연','31','010-2345-3301','fg@naber.com','seoul-44-78',9,'사원',3700),(61,'김지수','30','010-2345-3322','ff@naber.com','incheon-22-11',9,'대리',3500),(62,'박선우','30','010-2345-3334','fh@naber.com','daejun-44-11',9,'대리',3500),(63,'박찬원','32','010-2345-3359','fk@naber.com','daegu-66-11',9,'대리',3600),(64,'이정우','35','010-2345-3365','fl@naber.com','seoul-44-99',9,'과장',4100),(65,'김진선','35','010-2345-3374','fo@naber.com','incheon-22-32',9,'과장',4000),(66,'최전웅','36','010-2345-3385','fp@naber.com','anyang-44-11',9,'과장',4100),(67,'김선태','40','010-2345-3398','fu@naber.com','ulsan-11-11',9,'차장',4500),(68,'김경일','41','010-2345-4401','fq@naber.com','incheon-22-58',9,'차장',4600),(69,'최우진','45','010-2345-4408','fs@naber.com','ulsan-11-25',9,'부장',5000),(70,'홍수연','45','010-2345-4412','ft@naber.com','daegu-33-27',9,'부장',5000),(71,'이주영','24','010-2345-4424','gc@naber.com','ulsan-11-36',10,'사원',3000),(72,'김아선','25','010-2345-4436','ge@naber.com','ulsan-11-45',10,'사원',3000),(73,'최사랑','30','010-2345-4448','gf@naber.com','gwangju-44-12',10,'대리',3500),(74,'김준석','31','010-2345-4458','gh@naber.com','seoul-55-15',10,'대리',3500),(75,'이상원','35','010-2345-4466','ga@naber.com','incheon-33-33',10,'과장',4000),(76,'박정원','35','010-2345-4475','gk@naber.com','daejun-44-23',10,'과장',4000),(77,'최승훈','40','010-2345-4487','gr@naber.com','anyang-44-28',10,'차장',4500),(78,'박수연','40','010-2345-4491','gl@naber.com','seoul-55-19',10,'차장',4500),(79,'박태수','45','010-2345-5500','go@naber.com','daegu-33-88',10,'부장',5000),(80,'진정웅','44','010-2345-5513','gv@naber.com','anyang-44-56',10,'부장',5000),(81,'김창선','24','010-2345-5524','ia@naber.com','suwon-33-23',11,'사원',3000),(82,'전태수','25','010-2345-5536','ib@naber.com','seoul-55-16',11,'사원',3100),(83,'이가람','25','010-2345-5548','ie@naber.com','gwangju-35-65',11,'사원',3100),(84,'김가람','24','010-2345-5554','ig@naber.com','seoul-55-38',11,'사원',3100),(85,'김가련','30','010-2345-5556','if@naber.com','incheon-22-56',11,'대리',3500),(86,'이병진','30','010-2345-5561','ih@naber.com','daejun-44-35',11,'대리',3500),(87,'이창범','31','010-2345-5570','ik@naber.com','daegu-33-57',11,'대리',3500),(88,'박창수','35','010-2345-5576','il@naber.com','seoul-55-42',11,'과장',4100),(89,'최창선','35','010-2345-5584','io@naber.com','incheon-22-68',11,'과장',4000),(90,'진진태','36','010-2345-5582','iu@naber.com','anyang-44-75',11,'과장',4000),(91,'정가희','40','010-2345-5591','iv@naber.com','ulsan-11-39',11,'차장',4500),(92,'이상후','41','010-2345-5598','iq@naber.com','incheon-22-95',11,'차장',4500),(93,'진태현','45','010-2345-6603','is@naber.com','ulsan-11-86',11,'부장',5100),(94,'지은희','45','010-2345-6608','it@naber.com','daegu-33-64',11,'부장',5100),(95,'정가을','24','010-2345-6612','jc@naber.com','ulsan-22-16',12,'사원',3000),(96,'정다운','25','010-2345-6624','je@naber.com','anyang-55-45',12,'사원',3000),(97,'이기선','30','010-2345-6632','jf@naber.com','seoul-55-56',12,'대리',3500),(98,'이정연','31','010-2345-6644','jh@naber.com','gwangju-44-15',12,'대리',3500),(99,'김원우','35','010-2345-6654','ja@naber.com','busan-44-33',12,'과장',4000),(100,'이지윤','35','010-2345-6660','jk@naber.com','suwon-44-23',12,'과장',4000),(101,'허자윤','40','010-2345-6672','jr@naber.com','anyang-66-15',12,'차장',4500),(102,'허승태','40','010-2345-6683','jl@naber.com','seoul-55-77',12,'차장',4500),(103,'박승진','46','010-2345-6698','jo@naber.com','suwon-44-38',12,'부장',5000),(104,'김상선','46','010-2345-7715','jv@naber.com','daejun-44-56',12,'부장',5000),(105,'김조운','24','010-2345-7720','kc@naber.com','busan-44-36',13,'사원',3000),(106,'이려원','25','010-2345-7733','ke@naber.com','daegu-66-59',13,'사원',3000),(107,'진수원','30','010-2345-7742','kf@naber.com','gwangju-44-26',13,'대리',3500),(108,'김장수','31','010-2345-7749','kh@naber.com','ulsan-22-81',13,'대리',3500),(109,'이주연','36','010-2345-7752','ka@naber.com','incheon-44-33',13,'과장',4000),(110,'황나현','36','010-2345-7768','ki@naber.com','daejun-44-79',13,'과장',4000),(111,'박기훈','41','010-2345-7777','kd@naber.com','ulsan-33-28',13,'차장',4500),(112,'박기전','41','010-2345-7782','kl@naber.com','gwangju-44-52',13,'차장',4500),(113,'이수연','45','010-2345-7789','kb@naber.com','daegu-44-88',13,'부장',5000),(114,'최가연','44','010-2345-7799','ks@naber.com','anyang-55-76',13,'부장',5000),(115,'지우연','24','010-2345-8810','pe@naber.com','ulsan-33-36',14,'사원',3000),(116,'김상원','25','010-2345-8816','pr@naber.com','suwon-55-45',14,'사원',3000),(117,'김윤희','26','010-2345-8826','pf@naber.com','gwangju-44-64',14,'사원',3100),(118,'최원상','31','010-2345-8830','ph@naber.com','seoul-55-90',14,'대리',3500),(119,'김민기','31','010-2345-8834','kew@naber.com','incheon-44-41',14,'대리',3500),(120,'박소진','35','010-2345-8839','pq@naber.com','daejun-44-85',14,'과장',4000),(121,'김승훈','36','010-2345-8845','pz@naber.com','anyang-55-79',14,'과장',4000),(122,'황수연','40','010-2345-8869','pl@naber.com','seoul-55-91',14,'차장',4500),(123,'홍지윤','41','010-2345-8872','po@naber.com','busan-55-88',14,'차장',4500),(124,'진태성','46','010-2345-8881','pv@naber.com','busan-44-75',14,'부장',5000),(125,'김성필','46','010-2345-8889','py@naber.com','daegu-55-56',14,'부장',5000);
/*!40000 ALTER TABLE `employees` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-12-02 11:41:30
